# Homework 1

In this homework set, we will practice using pandas to clean and prep our data.

In [3]:
# We are going to start importing the libraries we need
# all in one cell. 

# It is a good practice to keep all the imports in one cell so that
# we can easily see what libraries we are using in the notebook.
import pandas as pd

## There is no need to import libraries more than once!

# Household Income and Home Value in NYC
In this exercise, you are going to investigate the relationship between household income and home values in New York City. 

You are given the dataset `acs_nyc.csv`, which was extracted from the IPUMS NHGIS portal.

# Data Loading and Initial Exploration

In [4]:
acs_nyc = pd.read_csv('acs_nyc.csv')

Display the first 12 rows of the data. (1 pt)

In [5]:
## INSERT YOUR CODE HERE

In [6]:
## ANSWER
acs_nyc.head(12)

           FIPS  hh_income  house_value
0   36005000100        NaN          NaN
1   36005000200    70867.0     457300.0
2   36005000400    98090.0     456100.0
3   36005001600    40033.0     587600.0
4   36005001901    55924.0          NaN
5   36005001902    60804.0     425600.0
6   36005001903        NaN          NaN
7   36005001904        NaN          NaN
8   36005002001    20870.0          NaN
9   36005002002        NaN     441800.0
10  36005002300    22177.0          NaN
11  36005002400        NaN          NaN

How many rows and how many columns are in the data? (1pt)

In [7]:
## INSERT YOUR CODE HERE

In [8]:
acs_nyc.shape

(2327, 3)

What are the datatypes for each column? (1pt)

In [9]:
## INSERT YOUR CODE HERE

In [10]:
acs_nyc.dtypes

FIPS             int64
hh_income      float64
house_value    float64
dtype: object

Using one function, display the 25th, 50th, 75th percentiles, mean, min, max, count, and standard deviations for the `hh_income` and `house_value` columns. (1 pt)

In [11]:
## INSERT YOUR CODE HERE

In [12]:
acs_nyc.describe()

               FIPS      hh_income   house_value
count  2.327000e+03    2196.000000  1.966000e+03
mean   3.605504e+10   78730.628871  7.599776e+05
std    2.597624e+07   38669.599532  3.642487e+05
min    3.600500e+10   11988.000000  9.999000e+03
25%    3.604703e+10   53277.250000  5.306750e+05
50%    3.604715e+10   73199.500000  6.646000e+05
75%    3.608104e+10   96989.000000  9.087250e+05
max    3.608599e+10  250001.000000  2.000001e+06

# Data Manipulation
The FIPS code is a unique identifier for each administrative unit in the US. This is how to read a FIPS code. The number of digits in your `FIPS` columns corresponds to whether each row is a state, county, tract, or block. 

![This is how to read a FIPS code](https://customer.precisely.com/servlet/rtaImage?eid=ka0Vu0000000qGs&feoid=00N6g00000TynF6&refid=0EM6g0000010wuS)

1. What administrative unit is our dataset, based on how many FIPS digits in the `FIPS` column? (1 pt)

You can write your answer in this cell.

##ANSWER
TRACTS

2. Using the FIPS code, create the following columns: (5 pts)
- State
- County: 
    - Bronx County: 36005
    - Brooklyn County: 36047
    - Manhattan County: 36061
    - Queens County: 36081
    - Staten Island: 36085
- Tract_ID

In [13]:
## INSERT YOUR CODE HERE

In [14]:
## ANSWER
acs_nyc['State'] = 'NY'
acs_nyc['FIPS'] = acs_nyc['FIPS'].astype(str)

acs_nyc['County'] = 'Bronx'
acs_nyc.loc[(acs_nyc['FIPS'].str.contains('36005')), 'County'] = 'Bronx'
acs_nyc.loc[(acs_nyc['FIPS'].str.contains('36047')), 'County'] = 'Brooklyn'
acs_nyc.loc[(acs_nyc['FIPS'].str.contains('36061')), 'County'] = 'Manhattan'
acs_nyc.loc[(acs_nyc['FIPS'].str.contains('36081')), 'County'] = 'Queens'
acs_nyc.loc[(acs_nyc['FIPS'].str.contains('36085')), 'County'] = 'Staten Island'

acs_nyc['Tract_ID'] = acs_nyc['FIPS'].str[-6:]

3. Check for null values in the `hh_income` and `house_value` columns. Remove any rows with both hh_income and house_value missing. With the rest of the missing values, replace missing values in these columns with the mean value of their respective columns. (5 pts)

In [15]:
## INSERT YOUR CODE HERE

In [20]:
acs_nyc_new = acs_nyc[(acs_nyc.hh_income.isna()==False)| (acs_nyc.house_value.isna()==False)]
acs_nyc_new.loc[acs_nyc_new['hh_income'].isna(), 'hh_income'] = acs_nyc_new['hh_income'].mean()
acs_nyc_new.loc[acs_nyc_new['house_value'].isna(), 'house_value'] = acs_nyc_new['house_value'].mean()
acs_nyc_new = acs_nyc_new.reset_index(drop=True) #to reset the index of a DataFrame
acs_nyc_new

             FIPS     hh_income   house_value State         County Tract_ID
0     36005000200  70867.000000  457300.00000    NY          Bronx   000200
1     36005000400  98090.000000  456100.00000    NY          Bronx   000400
2     36005001600  40033.000000  587600.00000    NY          Bronx   001600
3     36005001901  55924.000000  759977.64649    NY          Bronx   001901
4     36005001902  60804.000000  425600.00000    NY          Bronx   001902
...           ...           ...           ...   ...            ...      ...
2207  36085030301  95913.000000  457600.00000    NY  Staten Island   030301
2208  36085030302  85842.000000  420500.00000    NY  Staten Island   030302
2209  36085031901  78730.628871  288300.00000    NY  Staten Island   031901
2210  36085031902  76066.000000  381600.00000    NY  Staten Island   031902
2211  36085032300  86471.000000  237100.00000    NY  Staten Island   032300

[2212 rows x 6 columns]

Verify that there are no more null values in these columns. (1 pt)

In [21]:
## INSERT YOUR CODE HERE

In [22]:
acs_nyc_new[acs_nyc_new['hh_income'].isna()]

Empty DataFrame
Columns: [FIPS, hh_income, house_value, State, County, Tract_ID]
Index: []

In [23]:
acs_nyc_new[acs_nyc_new['house_value'].isna()]

Empty DataFrame
Columns: [FIPS, hh_income, house_value, State, County, Tract_ID]
Index: []

# Data analysis

Group the data by `County` and find the median household income and house value. Which county has the lowest median house income and house value? Show this through sorting the dataframe's rows by lowest median household income to highest and only displaying the first row. (5pt)

In [24]:
## INSERT YOUR CODE HERE

In [26]:
sort_by_income = acs_nyc_new.groupby('County')[['hh_income']].median().sort_values('hh_income',ascending=True)
sort_by_income.head(1)

        hh_income
County
Bronx     44444.0

In [27]:
sort_by_value = acs_nyc_new.groupby('County')[['house_value']].median().sort_values('house_value',ascending=True)
sort_by_value.head(1)

        house_value
County
Bronx      550000.0

Which county has largest standard deviation in house income and house value? Show this through sorting the dataframe's rows by highest household income variance to lowest and only displaying the first row.(5pt)

In [20]:
## INSERT YOUR CODE HERE

In [28]:
sort_by_std_income = acs_nyc_new.groupby('County')['hh_income'].describe().sort_values('std',ascending=False)
sort_by_std_income[['std']].head(1)

                    std
County
Manhattan  58547.942749

In [29]:
sort_by_std_value = acs_nyc_new.groupby('County')['house_value'].describe().sort_values(by='std',ascending=False)
sort_by_std_value[['std']].head(1)

                     std
County
Manhattan  485595.141937

# Bonus (3 pts)
Take our original `acs_nyc.csv` and ask Chatgpt to clean it. What was the prompt that you gave it? Attach the dataset that it returned as a csv.

In [22]:
## INSERT YOUR CODE HERE